Revit 2027 API
EnergyAnalysisSpace.GetAnalyticalSurfaces Method
 Provides a way to access the collection of analytical surfaces for a space. Geometry data defining an analytical space volume. Through an analytical surface you can connect a source element with each polygon in a space. The analytical surfaces defines an enclosed volume bounded by the center plane of walls and the top plane of roofs and floors.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<EnergyAnalysisSurface> GetAnalyticalSurfaces()
Public Function GetAnalyticalSurfaces As IList(Of EnergyAnalysisSurface)
public:
IList<EnergyAnalysisSurface^>^ GetAnalyticalSurfaces()
member GetAnalyticalSurfaces : unit -> IList<EnergyAnalysisSurface>
Return Value
IList<EnergyAnalysisSurface>
 the collection of analytical surfaces for a space.
See Also
Reference
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace